documents/style-guide/git-commit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-21 一 23:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Commit Message Style Guide</title>
<meta name="author" content="Jeason" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git Commit Message Style Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7695fb6">1. Udacity Git Commit Message Style Guide</a>
<ul>
<li><a href="#org0aa4ad7">1.1. Introduction</a></li>
<li><a href="#orgf63a6cb">1.2. Commit messages</a>
<ul>
<li><a href="#org0aee62c">1.2.1. Message structure</a></li>
<li><a href="#org9c48060">1.2.2. The Type</a></li>
<li><a href="#orgc091ba3">1.2.3. The Subject</a></li>
<li><a href="#orgffb51a4">1.2.4. The Body</a></li>
<li><a href="#orgc94d9d0">1.2.5. The Footer</a></li>
<li><a href="#orge6fc6b2">1.2.6. Example commit Meaasge</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#URL: <a href="https://udacity.github.io/git-styleguide/">https://udacity.github.io/git-styleguide/</a>
</p>

<div id="outline-container-org7695fb6" class="outline-2">
<h2 id="org7695fb6"><span class="section-number-2">1.</span> Udacity Git Commit Message Style Guide</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0aa4ad7" class="outline-3">
<h3 id="org0aa4ad7"><span class="section-number-3">1.1.</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This style guide acts as officcl guide to follow in your project. Udacity evaluat will use this guide to grade your project. There are many opinion on the &ldquo;ideal&rdquo; styple in the world development. Therefore, in order to reduce the confusion on what style student follow during the course of their project, we urge all student to refer to this style guide for their project.
</p>
</div>
</div>

<div id="outline-container-orgf63a6cb" class="outline-3">
<h3 id="orgf63a6cb"><span class="section-number-3">1.2.</span> Commit messages</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0aee62c" class="outline-4">
<h4 id="org0aee62c"><span class="section-number-4">1.2.1.</span> Message structure</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
A commit messages consists of three distinct parts separated by a blank line: the tile
</p>

<pre class="example" id="org27fadeb">

type: subject

body

footer

</pre>

<p>
The tile consists of the type of the message and subject
</p>
</div>
</div>

<div id="outline-container-org9c48060" class="outline-4">
<h4 id="org9c48060"><span class="section-number-4">1.2.2.</span> The Type</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
The  type is contained within the title and can be one of these types:
</p>

<ul class="org-ul">
<li>feat: A new feature</li>
<li>fix: A but fixed</li>
<li>docs: Change to documention</li>
<li>refactor: Refactoring production code</li>
<li>test: Add tests, refactoring test. no production code change</li>
<li>chore: Updating build  tasks, package manager configs, no production code change</li>
</ul>
</div>
</div>

<div id="outline-container-orgc091ba3" class="outline-4">
<h4 id="orgc091ba3"><span class="section-number-4">1.2.3.</span> The Subject</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Subject should be no  greater than 50  character, should begin with a capital letter and do not end with period.
</p>

<p>
Use an imperative tone to describe what a commit does, rather than what it did. For example, use <b>change</b>; not changed
</p>
</div>
</div>

<div id="outline-container-orgffb51a4" class="outline-4">
<h4 id="orgffb51a4"><span class="section-number-4">1.2.4.</span> The Body</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Not all commits are complex enough to warrant a body, therefore it is optional and only used when a commit requires a bit explanation and context. Use the body to explain the <b>what</b> and <b>why</b> of a commit,not the how.
</p>

<p>
when writing a body, the blank line between the title and the body is required and you should limit the length of each line to no more than 72 characters.
</p>
</div>
</div>

<div id="outline-container-orgc94d9d0" class="outline-4">
<h4 id="orgc94d9d0"><span class="section-number-4">1.2.5.</span> The Footer</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
the footer is optional and is used to reference issue tracker IDs.
</p>
</div>
</div>

<div id="outline-container-orge6fc6b2" class="outline-4">
<h4 id="orge6fc6b2"><span class="section-number-4">1.2.6.</span> Example commit Meaasge</h4>
<div class="outline-text-4" id="text-1-2-6">
<pre class="example" id="org4f514c9">
feat: Summarize changes in around 50 characters or less

More detailed explanatory text, if nessary. Wrap it to about 72
charcters or so. In some contexts, the first line is treated as the
subjct of the comit and the rest of the text as the body. The blank
line separating the summary from the body is critial
(unless you omit the body entirely)
various tools like `log` `shortlog` and `rebase` cna get confused if
you run the two together.

Explain the probem that this commit is solving. Focus on why you
are making this change as opposed to how
(the code explain that)
Are there side effects or other unintutive consequences of this
change? Here's tha place to explan them.

Further paragraphs come after blank lines.

- Bullet plints are okay, tools
- Typically a hyphen or asterisk is used for the bullet, preceded
by a single space, with blank lines in between, but conventions
vary here

If you use an issue traker, put reference the them at the bottom,
like this:

Resolves: #123
See also: #456, #789

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jeason</p>
<p class="date">Created: 2023-08-21 一 23:06</p>
</div>
</body>
</html>