documents/style-guide/git-commit.tex
% Created 2023-08-21 一 23:07
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jeason}
\date{\today}
\title{Git Commit Message Style Guide}
\hypersetup{
 pdfauthor={Jeason},
 pdftitle={Git Commit Message Style Guide},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\#URL: \url{https://udacity.github.io/git-styleguide/}

\section{Udacity Git Commit Message Style Guide}
\label{sec:orgbb5b664}
\subsection{Introduction}
\label{sec:orgcf2119d}

This style guide acts as officcl guide to follow in your project. Udacity evaluat will use this guide to grade your project. There are many opinion on the ``ideal'' styple in the world development. Therefore, in order to reduce the confusion on what style student follow during the course of their project, we urge all student to refer to this style guide for their project.

\subsection{Commit messages}
\label{sec:orgd1bb2a9}

\subsubsection{Message structure}
\label{sec:org0cb6974}

A commit messages consists of three distinct parts separated by a blank line: the tile

\begin{verbatim}

type: subject

body

footer

\end{verbatim}

The tile consists of the type of the message and subject

\subsubsection{The Type}
\label{sec:org6ac3e5b}
The  type is contained within the title and can be one of these types:

\begin{itemize}
\item feat: A new feature
\item fix: A but fixed
\item docs: Change to documention
\item refactor: Refactoring production code
\item test: Add tests, refactoring test. no production code change
\item chore: Updating build  tasks, package manager configs, no production code change
\end{itemize}

\subsubsection{The Subject}
\label{sec:org8d4db7b}
Subject should be no  greater than 50  character, should begin with a capital letter and do not end with period.

Use an imperative tone to describe what a commit does, rather than what it did. For example, use \textbf{change}; not changed

\subsubsection{The Body}
\label{sec:org837d8bb}
Not all commits are complex enough to warrant a body, therefore it is optional and only used when a commit requires a bit explanation and context. Use the body to explain the \textbf{what} and \textbf{why} of a commit,not the how.

when writing a body, the blank line between the title and the body is required and you should limit the length of each line to no more than 72 characters.

\subsubsection{The Footer}
\label{sec:org7fc6a86}
the footer is optional and is used to reference issue tracker IDs.

\subsubsection{Example commit Meaasge}
\label{sec:orgcb94d06}

\begin{verbatim}
feat: Summarize changes in around 50 characters or less

More detailed explanatory text, if nessary. Wrap it to about 72
charcters or so. In some contexts, the first line is treated as the
subjct of the comit and the rest of the text as the body. The blank
line separating the summary from the body is critial
(unless you omit the body entirely)
various tools like `log` `shortlog` and `rebase` cna get confused if
you run the two together.

Explain the probem that this commit is solving. Focus on why you
are making this change as opposed to how
(the code explain that)
Are there side effects or other unintutive consequences of this
change? Here's tha place to explan them.

Further paragraphs come after blank lines.

- Bullet plints are okay, tools

- Typically a hyphen or asterisk is used for the bullet, preceded
by a single space, with blank lines in between, but conventions
vary here

If you use an issue traker, put reference the them at the bottom,
like this:

Resolves: #123
See also: #456, #789

\end{verbatim}
\end{document}